constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver          ode_pyJac;
    method          loadBalanced_pyJac;
}

chemistry       on;

initialChemicalTimeStep 1e-07;

odeCoeffs
{
    solver          seulex_LAPACK;
    absTol          1e-10;
    relTol          1e-06;
}

loadbalancing
{
    active true;
    log	false; //true;
}

refmapping
{
    active  true;

    mixtureFractionProperties
    {
        oxidizerMassFractions
        {
            N2       0.7198319;
            O2       0.164119;
            CO2      0.0937502;
            H2O      0.0222989;
        }

        fuelMassFractions
        {
            C12H26       1.0;
        }

        #include "$FOAM_CASE/constant/foam_mech/thermo.foam"
    }
    tolerance	1e-4;  // mixture fraction tolerance
    //deltaT	2; // temperature tolerance
}

reactions
{
}

// ************************************************************************* //
