system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Define the inner block ==> square prism with side length 64 mm
ds_r       32.0;
ds_l      -32.0;

// Define the outer cylinder, with Rout=55mm, dz=Rout*cos45, dy=Rout*sin45
Rout        60.9324750232;
RoutN      -60.9324750232;
dz_r       43.0857662834;
dy_u       43.0857662834;
dz_l      -43.0857662834;
dy_d      -43.0857662834;

// Define cylinder length as L=100D=9mm
L           108.0;

// scales to millimeter
convertToMeters 0.001;

vertices
(
    (0.0 $ds_r $ds_r)      // 0
    (0.0 $ds_r $ds_l)      // 1
    (0.0 $ds_l $ds_l)      // 2
    (0.0 $ds_l $ds_r)      // 3
    (0.0 $dy_u $dz_r)      // 4
    (0.0 $dy_u $dz_l)      // 5
    (0.0 $dy_d $dz_l)      // 6
    (0.0 $dy_d $dz_r)      // 7

    ($L $ds_r $ds_r)      // 8
    ($L $ds_r $ds_l)      // 9
    ($L $ds_l $ds_l)      // 10
    ($L $ds_l $ds_r)      // 11
    ($L $dy_u $dz_r)      // 12
    ($L $dy_u $dz_l)      // 13
    ($L $dy_d $dz_l)      // 14
    ($L $dy_d $dz_r)      // 15
);

blocks
(
    hex (2 10 9 1 3 11 8 0) (108 64 64) simpleGrading (1 1 1)         // block 0
    // Outer cylindrical blocks
    hex (3 11 8 0 7 15 12 4) (108 64 23) simpleGrading (1 1 1)          // block 1
    hex (1 9 13 5 0 8 12 4) (108 23 64) simpleGrading (1 1 1)          // block 2
    hex (6 14 13 5 2 10 9 1) (108 64 23) simpleGrading (1 1 1)          // block 3
    hex (6 14 10 2 7 15 11 3) (108 23 64) simpleGrading (1 1 1)          // block 4
);


edges
(
    // Rout=55mm
    arc 7 4 (0.0 0.0 $Rout)         // block 1
    arc 4 5 (0.0 $Rout 0.0)          // block 2
    arc 5 6 (0.0 0.0 $RoutN)        // block 3
    arc 6 7 (0.0 $RoutN 0.0)        // block 4

    // Rout=555mm
    arc 15 12 ($L 0.0 $Rout)         // block 1
    arc 12 13 ($L $Rout 0.0)         // block 2
    arc 13 14 ($L 0.0 $RoutN)        // block 3
    arc 14 15 ($L $RoutN 0.0)        // block 4
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            // walls at the inlet
            (0 1 2 3)
            (0 3 7 4)
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            // walls at the lateral surfaces
            (7 15 12 4)
            (4 12 13 5)
            (13 14 6 5)
            (14 15 7 6)
            // walls at the outlet
            (11 10 9 8)
            (8 12 15 11)
            (8 9 13 12)
            (14 13 9 10)
            (15 14 10 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
